{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"config": {"output_layers": [["dense_1", 0, 0]], "name": "model", "layers": [{"name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block1_conv1", "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block1_conv2", "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "dtype": "float32", "name": "block1_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block2_conv1", "filters": 128, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block2_conv2", "filters": 128, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "dtype": "float32", "name": "block2_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block3_conv1", "filters": 256, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block3_conv2", "filters": 256, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block3_conv3", "filters": 256, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "dtype": "float32", "name": "block3_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block4_conv1", "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block4_conv2", "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block4_conv3", "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "dtype": "float32", "name": "block4_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block5_conv1", "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block5_conv2", "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"bias_regularizer": null, "trainable": false, "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block5_conv3", "filters": 512, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"strides": [2, 2], "trainable": false, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "dtype": "float32", "name": "block5_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "average_pooling2d", "config": {"strides": [4, 4], "trainable": true, "pool_size": [4, 4], "data_format": "channels_last", "padding": "valid", "dtype": "float32", "name": "average_pooling2d"}, "class_name": "AveragePooling2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "flatten", "config": {"dtype": "float32", "data_format": "channels_last", "trainable": true, "name": "flatten"}, "class_name": "Flatten", "inbound_nodes": [[["average_pooling2d", 0, 0, {}]]]}, {"name": "dense", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 64, "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense"}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "dropout", "config": {"trainable": true, "seed": null, "dtype": "float32", "name": "dropout", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 2, "dtype": "float32", "activation": "softmax", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}, "training_config": {"metrics": ["accuracy"], "optimizer_config": {"config": {"amsgrad": false, "beta_1": 0.8999999761581421, "learning_rate": 0.0010000000474974513, "decay": 3.9999998989515007e-05, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "name": "Adam"}, "class_name": "Adam"}, "loss_weights": null, "loss": "binary_crossentropy", "weighted_metrics": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of15.bin", "group1-shard2of15.bin", "group1-shard3of15.bin", "group1-shard4of15.bin", "group1-shard5of15.bin", "group1-shard6of15.bin", "group1-shard7of15.bin", "group1-shard8of15.bin", "group1-shard9of15.bin", "group1-shard10of15.bin", "group1-shard11of15.bin", "group1-shard12of15.bin", "group1-shard13of15.bin", "group1-shard14of15.bin", "group1-shard15of15.bin"], "weights": [{"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [512, 64], "dtype": "float32"}, {"name": "dense/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [64, 2], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [2], "dtype": "float32"}]}]}